# Constants for 72craft's Tools addon
# Material names, material lists, scene names, and pose bone names

# 脸红相关的材质名
MATERIAL_BLUSH = ["顏+", "脸+", "颜+","脸+"]

# AOV(眼透)相关的材质列表
MATERIALS_EYE = ["眉睫", "白目", "目", "目光", "眉毛", "眼白", "眼睛", "瞳孔"]
MATERIALS_FACE = ["顏", "脸", "颜", "脸"]
MATERIALS_HAIR = ["头发", "髪"]

# Scene Names
SCENE_COMPOSITOR_BASE = "72craft的合成器场景"

# 骨骼分类相关的骨骼名
POSE_BONES = {
    # Center bones
    "両目", "頭", "首", "上半身2", "上半身", "下半身", "腰", "グルーブ",
    # Left Bones (Japanese)
    "左肩", "左腕", "左腕捩", "左ひじ", "左手捩", "左手首", "左親指０",
    "左親指１", "左親指２", "左小指１", "左薬指１", "左中指１", "左人指１",
    "左小指２", "左薬指２", "左中指２", "左人指２",
    "左小指３", "左薬指３", "左中指３", "左人指３",
    # Left Bones (.L)
    "肩.L", "腕.L", "腕捩.L", "ひじ.L", "手捩.L", "手首.L", "親指０.L",
    "親指１.L", "親指２.L", "人指１.L", "人指２.L", "人指３.L", "中指１.L",
    "中指２.L", "中指３.L", "薬指１.L", "薬指２.L", "薬指３.L", "小指１.L",
    "小指２.L", "小指３.L", "足ＩＫ.L",
    # Right Bones (Japanese)
    "右肩", "右腕", "右腕捩", "右ひじ", "右手捩", "右手首", "右親指０",
    "右親指１", "右親指２", "右小指１", "右薬指１", "右中指１", "右人指１",
    "右小指２", "右薬指２", "右中指２", "右人指２",
    "右小指３", "右薬指３", "右中指３", "右人指３",
    "右足ＩＫ", "左足ＩＫ",
    # Right Bones (.R)
    "肩.R", "腕.R", "腕捩.R", "ひじ.R", "手捩.R", "手首.R", "親指０.R",
    "親指１.R", "親指２.R", "人指１.R", "人指２.R", "人指３.R", "中指１.R",
    "中指２.R", "中指３.R", "薬指１.R", "薬指２.R", "薬指３.R", "小指１.R",
    "小指２.R", "小指３.R", "足ＩＫ.R"
}

